# CreateElectricalConnector Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ConnectorElement..::..CreateElectricalConnector Method
ConnectorElement Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CreateElectricalConnector(Document, ElectricalSystemType, Reference) | Create a new electrical ConnectorElement. |
| CreateElectricalConnector(Document, ElectricalSystemType, Reference, Edge) | Create a new electrical ConnectorElement. |

# See Also
ConnectorElement Class
ConnectorElement Members
Autodesk.Revit.DB Namespace